app/views/admins/index.html.erb

SELECT "tweets".* FROM "tweets"
---
<script type="text/javascript">
  $(document).ready(function(){
    $(".post_tweet").live('click', function(e){
      var postTweet = {
        hidden : $(this).parent().parent().find('input[type="hidden"]'),
        monthDay : $(this).parent().parent().find('input[type="text"]'),
        deleteRow : $(this).parent().parent(),
        success : function(data){
          this.deleteRow.remove();
        }
      };

      $.ajax({
        type: 'POST',
        url: '/tweets.json',
        data: postTweet.hidden.serialize() + "&" +  postTweet.monthDay.serialize(),
        success: $.proxy(postTweet.success, postTweet)
      });

    });

   $("#category_id").change(function(e){