app/controllers/admins_controller.rb

  def deleteall
    @tweets = Tweet.all

    @tweets.each do |tweet|
      tweet.destroy
---
SELECT "tweets".* FROM "tweets"
DELETE FROM "tweets" WHERE ("tweets"."id" = 1)