app/controllers/branches_controller.rb

SELECT "branches".* FROM "branches"
---
  def index
    @branches = Branch.all

SELECT "treedatas".* FROM "treedatas" ORDER BY treedatas.id DESC LIMIT 1
SELECT "branches".* FROM "branches"
INSERT INTO "branches" ("scale", "y", "rotation", "length", "created_at", "updated_at", "ancestry", "ancestry_depth", "tweet_id", "tweeted") VALUES (0.7574089902103687, -100.0, -70.0, 150.0, '2010-12-11 03:01:46.955250', '2010-12-11 03:01:46.955250', '1', 1, -1, 'f')
---
  def init
    @treedata = Treedata.last
    if @treedata
      @treedata.destroy
    end

    @branches = Branch.all

    if @branches
      @branches.each do |branch|
        branch.destroy
      end
    end


    @root = Branch.new
    @root.length = 100
    @root.rotation = 0
    @root.y = 0
    @root.scale = 1

    @root.save

INSERT INTO "treedatas" ("created_at", "updated_at", "branch_id", "currentDepth", "centerbranch_id", "currentTweet", "centerTweet") VALUES ('2010-12-11 03:01:47.236500', '2010-12-11 03:01:47.236500', 1, 1, 4, 0, 3)
---
    @treedata.branch = @root
    @treedata.centerbranch = @centerBranch
    @treedata.currentDepth = 1
    @treedata.save