app/controllers/categories_controller.rb

  def index
    @categories = Category.all
    @category = Category.new
    @tweets = Tweet.all
---
SELECT "categories".* FROM "categories"
SELECT "tweets".* FROM "tweets"

  def edit

    @category = Category.find(params[:id])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1

  def update

    @category = Category.find(params[:id])

    @category.update_attributes(params[:category])
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
UPDATE "categories" SET "huemin" = 25, "huemax" = 42, "updated_at" = '2010-12-13 05:45:04.281250' WHERE ("categories"."id" = 1)

  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("title", "question_id", "created_at", "updated_at", "huemin", "huemax") VALUES ('좋음', NULL, '2010-12-13 05:44:25.437500', '2010-12-13 05:44:25.437500', NULL, NULL)

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 2) LIMIT 1
DELETE FROM "categories" WHERE ("categories"."id" = 2)