app/controllers/treedatas_controller.rb

  def index
    @treedata = Treedata.last
---
SELECT "treedatas".* FROM "treedatas" ORDER BY treedatas.id DESC LIMIT 1