app/controllers/tweets_controller.rb

SELECT "tweets".* FROM "tweets"
---
  def tweetlist
    @tweets = Tweet.all

SELECT "tweets".* FROM "tweets" WHERE ("tweets"."id" = 3) LIMIT 1
SELECT "categories".* FROM "categories" WHERE ("categories"."id" = 1) LIMIT 1
UPDATE "tweets" SET "category_id" = 1, "updated_at" = '2010-12-13 05:47:10.921875' WHERE ("tweets"."id" = 3)
---
  def update
    @tweet = Tweet.find(params[:id])
    @tweet.category = Category.find(params[:category_id])


    respond_to do |format|
      if @tweet.save

INSERT INTO "tweets" ("title", "screen_name", "status_id", "created_at", "updated_at", "question_id", "month", "day", "pic", "category_id") VALUES ('wffwwwwwwwwwwwwwwwwwwwwwwwww', 'rdwks', 13427812115423232, '2010-12-11 03:00:14.158375', '2010-12-11 03:00:14.158375', NULL, 10, 26, 'http://s.twimg.com/a/1291318259/images/default_profile_0_normal.png', -1)
SELECT "treedatas".* FROM "treedatas" ORDER BY treedatas.id DESC LIMIT 1
INSERT INTO "branches" ("scale", "y", "rotation", "length", "created_at", "updated_at", "ancestry", "ancestry_depth", "tweet_id", "tweeted") VALUES (0.644601761092247, -150.0, -50.0, 164.0, '2010-12-11 03:02:12.142750', '2010-12-11 03:02:12.142750', '1/2', 2, -1, 'f')
UPDATE "branches" SET "tweet_id" = 3, "updated_at" = '2010-12-11 03:02:11.892750' WHERE ("branches"."id" = 2)
UPDATE "treedatas" SET "centerTweet" = 6, "currentTweet" = 0, "updated_at" = '2010-12-11 03:30:17.174000' WHERE ("treedatas"."id" = 1)
SELECT "branches".* FROM "branches" WHERE (ancestry like '1/%' or ancestry = '1') AND (tweet_id = -1 AND rotation != 0) ORDER BY ancestry_depth ASC LIMIT 1
SELECT COUNT(*) FROM "branches" WHERE (ancestry like '1/%' or ancestry = '1') AND (tweet_id = '' AND rotation != 0)
---
  def create
    @tweet = Tweet.new
    date = params[:date].split('/')

    @tweet.month = date[0]
    @tweet.day = date[1]
    @tweet.title = params[:memory]
    @tweet.screen_name = params[:screen_name]
    @tweet.status_id = params[:status_id]
    @tweet.pic = params[:pic]


    respond_to do |format|
      if @tweet.save

        @treedata = Treedata.last

        @branch = treeSelect(@treedata)
        @branch.tweet_id = @tweet.id
        @branch.save

        len = Random.new.rand(100..200)

        @rightBranch = Branch.new
        @rightBranch.scale = @branch.scale * Random.new.rand(0.7..0.99)
        @rightBranch.length = len

SELECT "tweets".* FROM "tweets" WHERE ("tweets"."status_id" = 13398877335986176) LIMIT 1
---
  def already_posted
    @tweet = Tweet.find_by_status_id(params[:status_id])